jmeter/tests-plans/upload_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="GeoNode Upload TestPlan" enabled="true">
      <stringProp name="TestPlan.comments">Upload test with Basic Auth, uses env vars</stringProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <!-- HTTP Authorization Manager (Basic Auth) -->
      <AuthManager guiclass="AuthPanel" testclass="AuthManager" testname="HTTP Authorization Manager" enabled="true">
        <collectionProp name="AuthManager.auth_list">
          <elementProp elementType="AuthManager.User" name="">
            <stringProp name="Authorization.username">${__env(BASIC_USER)}</stringProp>
            <stringProp name="Authorization.password">${__env(BASIC_PASS)}</stringProp>
            <stringProp name="Authorization.url">${__env(PROTOCOL)}://${__env(HOST)}${__env(UPLOAD_ENDPOINT)}</stringProp>
          </elementProp>
        </collectionProp>
      </AuthManager>
      <hashTree/>
      <!-- Thread Group -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Upload Users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__env(USERS)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__env(RAMPUP)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__env(DURATION)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <!-- HTTP Request (multipart upload) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Upload File (multipart)" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__env(HOST)}</stringProp>
          <stringProp name="HTTPSampler.port">${__env(PORT)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__env(PROTOCOL)}</stringProp>
          <stringProp name="HTTPSampler.path">${__env(UPLOAD_ENDPOINT)}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Files" elementType="HTTPFileArgs">
            <collectionProp name="HTTPFileArgs.files">
              <elementProp elementType="HTTPFileArg" name="file1">
                <stringProp name="HTTPFileArg.path">${__env(UPLOAD_FILE)}</stringProp>
                <stringProp name="HTTPFileArg.paramname">${__env(UPLOAD_FORM_FIELD)}</stringProp>
                <stringProp name="HTTPFileArg.mimetype">application/zip</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <!-- Response Assertion: expect HTTP 200 -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert: HTTP 200" enabled="true">
            <collectionProp name="Asserion.test_strings"/>
            <stringProp name="ResponseAssertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="ResponseAssertion.assume_success">false</boolProp>
            <intProp name="ResponseAssertion.test_type">2</intProp>
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">200</stringProp>
            </collectionProp>
          </ResponseAssertion>
          <hashTree/>
          <!-- Constant Timer small delay to avoid burst -->
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Delay 200ms" enabled="true">
            <stringProp name="ConstantTimer.delay">200</stringProp>
          </ConstantTimer>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>