jmeter/tests-plans/wfs_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="WFS Load Test" enabled="true">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="WFS Users" enabled="true">
        <stringProp name="ThreadGroup.num_threads">${__env(USERS)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__env(RAMPUP)}</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">-1</stringProp>
        </elementProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__env(DURATION)}</stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="WFS GetFeature" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="service" elementType="HTTPArgument">
                <stringProp name="HTTPArgument.name">service</stringProp>
                <stringProp name="HTTPArgument.value">WFS</stringProp>
              </elementProp>
              <elementProp name="request" elementType="HTTPArgument">
                <stringProp name="HTTPArgument.name">request</stringProp>
                <stringProp name="HTTPArgument.value">GetFeature</stringProp>
              </elementProp>
              <elementProp name="typeName" elementType="HTTPArgument">
                <stringProp name="HTTPArgument.name">typeName</stringProp>
                <stringProp name="HTTPArgument.value">${__env(LAYER_NAME)}</stringProp>
              </elementProp>
              <elementProp name="outputFormat" elementType="HTTPArgument">
                <stringProp name="HTTPArgument.name">outputFormat</stringProp>
                <stringProp name="HTTPArgument.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${__env(HOST)}</stringProp>
          <stringProp name="HTTPSampler.port">${__env(PORT)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__env(PROTOCOL)}</stringProp>
          <stringProp name="HTTPSampler.path">/geoserver/ows</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200" enabled="true">
            <stringProp name="ResponseAssertion.test_field">Assertion.response_code</stringProp>
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">200</stringProp>
            </collectionProp>
          </ResponseAssertion>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert contains FeatureCollection" enabled="true">
            <stringProp name="ResponseAssertion.test_field">Assertion.response_data</stringProp>
            <collectionProp name="Asserion.test_strings">
              <stringProp name="1">FeatureCollection</stringProp>
            </collectionProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>